archives/2024/Results/Verifications/S2427/bottleneck-determination/update_index/threads-24/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=24 oltp_update_index --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-ty
pe=uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 24
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 24 tps: 4207.95 qps: 4207.95 (r/w/o: 0.00/4105.00/102.95) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 24 tps: 4099.18 qps: 4099.18 (r/w/o: 0.00/3998.38/100.80) lat (ms,95%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 24 tps: 4856.40 qps: 4856.40 (r/w/o: 0.00/4741.30/115.10) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 24 tps: 5070.52 qps: 5070.52 (r/w/o: 0.00/4943.42/127.10) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 24 tps: 5009.21 qps: 5009.21 (r/w/o: 0.00/4888.91/120.30) lat (ms,95%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 24 tps: 4974.00 qps: 4974.00 (r/w/o: 0.00/4854.80/119.20) lat (ms,95%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 24 tps: 5146.31 qps: 5146.31 (r/w/o: 0.00/5017.71/128.60) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 24 tps: 5233.56 qps: 5233.56 (r/w/o: 0.00/5106.26/127.30) lat (ms,95%): 6.91 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 24 tps: 4897.83 qps: 4897.83 (r/w/o: 0.00/4774.13/123.70) lat (ms,95%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 24 tps: 5164.13 qps: 5164.13 (r/w/o: 0.00/5027.35/136.79) lat (ms,95%): 7.30 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           474620
        other:                           12019
        total:                           486639
    transactions:                        486639 (4865.77 per sec.)
    queries:                             486639 (4865.77 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0082s
    total number of events:              486639

Latency (ms):
         min:                                    1.14
         avg:                                    4.93
         max:                                  158.40
         95th percentile:                        7.98
         sum:                              2399278.32

Threads fairness:
    events (avg/stddev):           20276.6250/31.92
    execution time (avg/stddev):   99.9699/0.00


real    1m40.190s
user    0m7.944s
sys     0m19.127s